devdnl/dnx-rtos/src/system/drivers/eth/stm32fx/eth.c
                // reset Ethernet
                ETH_DeInit();
                ETH_SoftwareReset();

                u32_t timeout = sys_time_get_reference();
                while (  ETH_GetSoftwareResetStatus() == SET
                      && !sys_time_is_expired(timeout, INIT_TIMEOUT));

                if (sys_time_is_expired(timeout, INIT_TIMEOUT)) {
                        err = ETIME;
                        goto finish;
                }

                // enable interrupts
                SET_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN | RCC_AHBxENR_ETHMACTXEN | RCC_AHBxENR_ETHMACEN);

                NVIC_EnableIRQ(ETH_IRQn);
                NVIC_SetPriority(ETH_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                /* MAC configuration */
                /*
                 * Ethernet DMA configuration
                 * When we use the Checksum offload feature, we need to enable the Store and Forward mode:
                 * the store and forward guarantee that a whole frame is stored in the FIFO, so the MAC can
                 * insert/verify the checksum, if the checksum is OK the DMA can handle the frame otherwise
                 * the frame is dropped
                 */
                ETH_InitTypeDef ETH_InitStructure;
                ETH_StructInit(&ETH_InitStructure);
                ETH_InitStructure.ETH_AutoNegotiation             = ETH_PHY_AUTONEGOTIATION;
                ETH_InitStructure.ETH_LoopbackMode                = ETH_LoopbackMode_Disable;
                ETH_InitStructure.ETH_RetryTransmission           = ETH_RetryTransmission_Disable;
                ETH_InitStructure.ETH_AutomaticPadCRCStrip        = ETH_AutomaticPadCRCStrip_Disable;
                ETH_InitStructure.ETH_ReceiveAll                  = ETH_ReceiveAll_Disable;
                ETH_InitStructure.ETH_BroadcastFramesReception    = ETH_BroadcastFramesReception_Enable;
                ETH_InitStructure.ETH_PromiscuousMode             = ETH_PromiscuousMode_Disable;
                ETH_InitStructure.ETH_MulticastFramesFilter       = ETH_MulticastFramesFilter_Perfect;
                ETH_InitStructure.ETH_UnicastFramesFilter         = ETH_UnicastFramesFilter_Perfect;
                ETH_InitStructure.ETH_Speed                       = ETH_SPEED;
                ETH_InitStructure.ETH_ChecksumOffload             = ETH_CHECKSUM_BY_HARDWARE ? ETH_ChecksumOffload_Enable : 0;
                ETH_InitStructure.ETH_DropTCPIPChecksumErrorFrame = ETH_DropTCPIPChecksumErrorFrame_Enable;
                ETH_InitStructure.ETH_ReceiveStoreForward         = ETH_ReceiveStoreForward_Enable;
                ETH_InitStructure.ETH_TransmitStoreForward        = ETH_TransmitStoreForward_Enable;
                ETH_InitStructure.ETH_ForwardErrorFrames          = ETH_ForwardErrorFrames_Disable;
                ETH_InitStructure.ETH_ForwardUndersizedGoodFrames = ETH_ForwardUndersizedGoodFrames_Disable;
                ETH_InitStructure.ETH_SecondFrameOperate          = ETH_SecondFrameOperate_Enable;
                ETH_InitStructure.ETH_AddressAlignedBeats         = ETH_AddressAlignedBeats_Enable;
                ETH_InitStructure.ETH_FixedBurst                  = ETH_FixedBurst_Enable;
                ETH_InitStructure.ETH_RxDMABurstLength            = ETH_RxDMABurstLength_32Beat;
                ETH_InitStructure.ETH_TxDMABurstLength            = ETH_TxDMABurstLength_32Beat;
                ETH_InitStructure.ETH_DMAArbitration              = ETH_DMAArbitration_RoundRobin_RxTx_2_1;

                if (ETH_Init(&ETH_InitStructure, ETH_PHY_ADDRESS)) {

                        eth = hdl;

                        ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R, ENABLE);

                        ETH_DMATxDescChainInit(eth->DMA_tx_descriptor,
                                               &eth->tx_buffer[0][0],
                                               ETH_TXBUFNB);

                        ETH_DMARxDescChainInit(eth->DMA_rx_descriptor,
                                               &eth->rx_buffer[0][0],
                                               ETH_RXBUFNB);

                        if (__ETH_CHECKSUM_BY_HARDWARE__ != 0) {
                                for (uint i = 0; i < ETH_TXBUFNB; i++) {
                                        ETH_DMATxDescChecksumInsertionConfig(&eth->DMA_tx_descriptor[i],
                                                                             ETH_DMATxDesc_ChecksumTCPUDPICMPFull);
                                }
                        }

                        for (uint i = 0; i < ETH_RXBUFNB; i++) {
                                ETH_DMARxDescReceiveITConfig(&eth->DMA_rx_descriptor[i], ENABLE);
                        }

                        sys_sleep_ms(ETH_PHY_CONFIG_DELAY);
                } else {
                        err = EIO;
                }

                finish:
                if (err != ESUCC) {
                        if (hdl->rx_data_ready)
                                sys_semaphore_destroy(hdl->rx_data_ready);

                        if (hdl->rx_access)
                                sys_mutex_destroy(hdl->rx_access);

                        if (hdl->tx_access)
                                sys_mutex_destroy(hdl->tx_access);

                        if (device_handle)
                                sys_free(device_handle);
                }
        }

        return err;
}

//==============================================================================
/**
 * @brief Release device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_RELEASE(ETH, void *device_handle)
{
        struct eth *hdl = device_handle;

        int err = sys_device_lock(&hdl->dev_lock);
        if (!err) {
                ETH_DeInit();
                NVIC_DisableIRQ(ETH_IRQn);
                CLEAR_BIT(RCC->AHBxENR, RCC_AHBxENR_ETHMACRXEN
                                      | RCC_AHBxENR_ETHMACTXEN
                                      | RCC_AHBxENR_ETHMACEN);
                sys_semaphore_destroy(hdl->rx_data_ready);
                sys_mutex_destroy(hdl->rx_access);
                sys_mutex_destroy(hdl->tx_access);
                sys_free(&device_handle);
                eth = NULL;
        }

