devdnl/dnx-rtos/src/system/drivers/eth/stm32fx/eth.c
        return err;
}

//==============================================================================
/**
 * @brief Open device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           flags                  file operation flags (O_RDONLY, O_WRONLY, O_RDWR)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_OPEN(ETH, void *device_handle, u32_t flags)
{
        UNUSED_ARG1(flags);

        struct eth *hdl = device_handle;

        return sys_device_lock(&hdl->dev_lock);
}

//==============================================================================
/**
 * @brief Close device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           force                  device force close (true)
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_CLOSE(ETH, void *device_handle, bool force)
{
        struct eth *hdl = device_handle;

        int err = sys_device_get_access(&hdl->dev_lock);

        if (!err) {
                err = sys_device_unlock(&hdl->dev_lock, force);
        }

        return err;
}

//==============================================================================
/**
 * @brief Write data to device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]          *src                    data source
 * @param[in ]           count                  number of bytes to write
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *wrcnt                  number of written bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_WRITE(ETH,
              void             *device_handle,
              const u8_t       *src,
              size_t            count,
              fpos_t           *fpos,
              size_t           *wrcnt,
              struct vfs_fattr  fattr)
{
        UNUSED_ARG1(fpos);

        struct eth *hdl = device_handle;

        if (is_Ethernet_started()) {

                if (sys_mutex_lock(hdl->tx_access, fattr.non_blocking_wr ? 0 : MAX_DELAY_MS) == ESUCC) {

                        *wrcnt = 0;
                        int err;

                        while (count) {
                                while (is_buffer_owned_by_DMA(DMATxDescToSet)) {

                                        if (fattr.non_blocking_wr) {
                                                err = EAGAIN;
                                                goto exit;
                                        }

                                        sys_sleep_ms(1);
                                }

                                size_t packet_size = min(count, ETH_MAX_PACKET_SIZE);

                                u8_t *buffer = get_buffer_address(DMATxDescToSet);
                                memcpy(buffer, src, packet_size);
                                send_packet(packet_size);

                                *wrcnt += packet_size;
                                count  -= packet_size;
                        }

                        err = ESUCC;

                        exit:
                        sys_mutex_unlock(hdl->tx_access);

                        return err;
                } else {
                        return EAGAIN;
                }

        } else {
                return EIO;
        }
}

//==============================================================================
/**
 * @brief Read data from device
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *dst                    data destination
 * @param[in ]           count                  number of bytes to read
 * @param[in ][out]     *fpos                   file position
 * @param[out]          *rdcnt                  number of read bytes
 * @param[in ]           fattr                  file attributes
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_READ(ETH,
             void            *device_handle,
             u8_t            *dst,
             size_t           count,
             fpos_t          *fpos,
             size_t          *rdcnt,
             struct vfs_fattr fattr)
{
        UNUSED_ARG1(fpos);

        struct eth *hdl = device_handle;

        if (is_Ethernet_started()) {
                if (count % ETH_MAX_PACKET_SIZE == 0) {

                        *rdcnt = 0;

                        if (sys_mutex_lock(hdl->rx_access, fattr.non_blocking_rd ? 0 : MAX_DELAY_MS) == ESUCC) {
                                size_t pkts = count / ETH_MAX_PACKET_SIZE;
                                while (pkts--) {
                                        size_t pkt_size = wait_for_packet(hdl, fattr.non_blocking_rd ? 0 : MAX_DELAY_MS);
                                        if (pkt_size) {
                                                u8_t *src = get_buffer_address(DMARxDescToGet);

                                                memcpy(dst, src, min(pkt_size, count));
                                                give_Rx_buffer_to_DMA();
                                                make_Rx_buffer_available();

                                                *rdcnt += pkt_size;
                                        } else {
                                                break;
                                        }
                                }

                                sys_mutex_unlock(hdl->rx_access);

                                return ESUCC;
                        } else {
                                return EAGAIN;
                        }
                } else {
                        return EINVAL;
                }
        } else {
                return EIO;
        }
}

//==============================================================================
/**
 * @brief IO control
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[in ]           request                request
 * @param[in ][out]     *arg                    request's argument
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_IOCTL(ETH, void *device_handle, int request, void *arg)
{
        struct eth *hdl = device_handle;

        int err;

        switch (request) {
        case IOCTL_ETH__WAIT_FOR_PACKET:

