devdnl/dnx-rtos/src/system/drivers/eth/stm32fx/eth.c
                if (arg) {
                        ETH_packet_wait_t *pw = cast(ETH_packet_wait_t*, arg);
                        pw->pkt_size = wait_for_packet(hdl, pw->timeout);
                        return ESUCC;
                } else {
                        return EINVAL;
                }
                break;

        case IOCTL_ETH__SET_MAC_ADDR:
                if (arg) {
                        ETH_MACAddressConfig(ETH_MAC_Address0, arg);
                        return ESUCC;
                } else {
                        return EINVAL;
                }
                break;

        case IOCTL_ETH__GET_MAC_ADDR:
                if (arg) {
                        u8_t *MAC = arg;

                        MAC[5] = ETH->MACA0HR >> 8;
                        MAC[4] = ETH->MACA0HR;
                        MAC[3] = ETH->MACA0LR >> 24;
                        MAC[2] = ETH->MACA0LR >> 16;
                        MAC[1] = ETH->MACA0LR >> 8;
                        MAC[0] = ETH->MACA0LR;

                        return ESUCC;
                } else {
                        return EINVAL;
                }
                break;

        case IOCTL_ETH__SEND_PACKET:
                if (arg) {
                        if (sys_mutex_lock(hdl->tx_access, MAX_DELAY_MS) == ESUCC) {
                                ETH_packet_t *pkt = arg;

                                while (is_buffer_owned_by_DMA(DMATxDescToSet)) {
                                        sys_sleep_ms(1);
                                }

                                if (  !is_buffer_owned_by_DMA(DMATxDescToSet)
                                   && pkt->payload
                                   && pkt->payload_size <= ETH_MAX_PACKET_SIZE) {

                                        u8_t *buffer = get_buffer_address(DMATxDescToSet);

                                        memcpy(buffer, pkt->payload, pkt->payload_size);

                                        send_packet(pkt->payload_size);

                                        err = ESUCC;
                                } else {
                                        printk("ETH: payload size too big or NULL");
                                        err = EAGAIN;
                                }

                                sys_mutex_unlock(hdl->tx_access);
                        } else {
                                err = EAGAIN;
                        }
                } else {
                        err = EINVAL;
                }
                break;

        case IOCTL_ETH__RECEIVE_PACKET:
                if (arg) {
                        if (sys_mutex_lock(hdl->rx_access, MAX_DELAY_MS) == ESUCC) {
                                ETH_packet_t *pkt = arg;

                                if (  pkt->payload
                                   && pkt->payload_size <= ETH_MAX_PACKET_SIZE) {

                                        // TEST check solution in tests
                                        while (is_buffer_owned_by_DMA(DMARxDescToGet)) {
                                                sys_sleep_ms(1);
                                        }

                                        if (ETH_GetRxPktSize(DMARxDescToGet) > 0) {

                                                u8_t *buffer = get_buffer_address(DMARxDescToGet);

                                                memcpy(pkt->payload, buffer, pkt->payload_size);

                                                give_Rx_buffer_to_DMA();

                                                err = ESUCC;
                                        } else {
                                                printk("ETH: received empty packet!");
                                                give_Rx_buffer_to_DMA();

                                                err = EIO;
                                        }

                                        make_Rx_buffer_available();

                                } else {
                                        err = EINVAL;
                                }

                                sys_mutex_unlock(hdl->rx_access);
                        } else {
                                err = EAGAIN;
                        }
                } else {
                        err = EINVAL;
                }
                break;

        case IOCTL_ETH__ETHERNET_START:
                ETH_Start();
                return ESUCC;

        case IOCTL_ETH__ETHERNET_STOP:
                ETH_Stop();
                return ESUCC;

        case IOCTL_ETH__GET_LINK_STATUS:
                if (arg) {
                        ETH_link_status_t *linkstat = cast(ETH_link_status_t*, arg);

                        if (ETH_ReadPHYRegister(ETH_PHY_ADDRESS, PHY_BSR) & PHY_BSR_LINK_STATUS) {
                                *linkstat = ETH_LINK_STATUS__CONNECTED;
                        } else {
                                *linkstat = ETH_LINK_STATUS__DISCONNECTED;
                        }

                        return ESUCC;
                } else {
                        return EINVAL;
                }

        default:
                return EBADRQC;
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(ETH, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        if (is_Ethernet_started()) {
                ETH_FlushTransmitFIFO();
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(ETH, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG1(device_handle);

